УТ_для_edt.РасширениеСмарт/src/DataProcessors/ЖурналДокументовПродажи/ЖурналДокументовПродажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="9442c42a-1265-415a-8691-6835a1a67c8b">
  <name>ЖурналДокументовПродажи</name>
  <objectBelonging>Adopted</objectBelonging>
</mdclass:DataProcessor>

УТ_для_edt.РасширениеСмарт/src/InformationRegisters/РеестрДокументов/РеестрДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>РеестрДокументов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources>
    <name>ДополнительнаяЗапись</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>ДатаПервичногоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Дополнительно</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>Проведен</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>ПометкаУдаления</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>ДатаОтраженияВУчете</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>НомерПервичногоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>НомерДокументаИБ</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Сумма</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="44860178-ace4-11e7-7088-f45c898df8f7">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="44863b70-ace4-11e7-7088-f45c898df8f7">
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>Ссылка</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>ТипСсылки</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>ДатаДокументаИБ</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>МестоХранения</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt.РасширениеСмарт/src/AccumulationRegisters/ТоварыКОтгрузке/ТоварыКОтгрузке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТоварыКОтгрузке</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources>
    <name>КОтгрузке</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>ВРезерве</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>КОформлению</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>КСборке</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>Собирается</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>Собрано</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <attributes>
    <name>ЗаданиеНаПеревозку</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions>
    <name>ДокументОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Получатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Назначение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

УТ_для_edt.РасширениеСмарт/src/Enums/СпособыДоставки/СпособыДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СпособыДоставки</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Самовывоз</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ДоКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>СиламиПеревозчикаПоАдресу</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>СиламиПеревозчика</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>КПолучателюОпределяетСлужбаДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>СиламиПеревозчикаДоПунктаПередачи</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>СиламиПоставщикаДоНашегоСклада</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>НашимиСиламиСАдресаОтправителя</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>СиламиПеревозчикаДоНашегоСклада</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтОтправителяОпределяетСлужбаДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="5d20c737-5039-4cee-a650-bca499bbc637">
    <name>смартСамовывозСоСкладаАдмирал</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="ecbfed88-7ed7-45eb-a8d5-8c11f88fbc12">
    <name>ПоручениеЭкспедиторуНаСклад</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="64858d0d-3081-4b86-946a-23810f59eebc">
    <name>ПоручениеЭкспедиторуСоСклада</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="266e90f6-450a-4536-8666-1cbbb3eedb6c">
    <name>ПоручениеЭкспедиторуВПункте</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

УТ_для_edt.РасширениеСмарт/src/Catalogs/Организации/Организации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Организации</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ИНН</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>КПП</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="4a3b4661-75a6-4317-9e52-a21fb3ad20b9">
    <name>ГоловнаяОрганизация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="64303e94-490e-4229-a86f-9d6a6769b763">
    <name>СвидетельствоСерияНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="a184b1dd-510a-46f6-b38c-2a1c8ff0217a">
    <name>ИндивидуальныйПредприниматель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0038fc7e-3157-476b-824d-811a30639c88">
    <name>ЦифровойИндексОбособленногоПодразделения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="11eb9dbe-02b3-4892-b634-f243b2dfd2f1">
    <name>НаименованиеСокращенное</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="0b153de3-87fe-4907-9e94-8556af48fda2">
    <name>НаименованиеПолное</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="685363b5-d549-4059-81c3-83f4001dac92">
    <name>НаименованиеМеждународное</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="1a2fdd27-2959-4e3e-9039-80e8cebcf1e2">
    <name>ОГРН</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="38df9827-83de-429d-a872-d44c4a5b383a">
    <name>КодОКВЭД</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>8</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="f17d55e6-7114-4f91-bee2-e2e64e65fa8b">
    <name>СвидетельствоДатаВыдачи</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="9e332fa6-d24a-436f-bac7-5e086c273763">
    <name>КодОКВЭД2</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>8</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="33c042cb-b26c-4c0d-acac-fde61b334c1f">
    <name>КодПоОКПО</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="d9e54389-8d99-4508-af2e-411a4520ca52">
    <name>КрупнейшийНалогоплательщик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1affc249-13d0-477e-b7a9-8a2b51caeb55">
    <name>ДатаРегистрации</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="75dc325f-619e-4beb-99ba-e69da503125b">
    <name>Префикс</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>2</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="0625e5ef-5727-4476-afca-88c6fce30fcd">
    <name>КодНалоговогоОрганаПолучателя</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>4</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="ecc0dbb2-ffb6-44df-9a60-571932153ea5">
    <name>ДопускаютсяВзаиморасчетыЧерезГоловнуюОрганизацию</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="83555d53-4331-4f0c-9a15-c46c7d8c9e73">
    <name>НеЗаполнятьПодразделенияВМероприятияхТрудовойДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="215bcd7a-1ae8-47a8-8fab-599989e59bc9">
    <name>смартГрузоотправители</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="73fa78e8-0e0d-4300-884d-53074a97228b">
      <name>Склад</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="0a933e94-c895-4b1a-ac32-fc1443ce396f">
      <name>Грузоотправитель</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt.РасширениеСмарт/src/DataProcessors/ЖурналДокументовПродажи/Forms/СписокДокументов/Module.bsl
#Область ПеренесеноСДоработками

&НаКлиенте
Процедура смарт_ОбработкаОповещенияПосле(ИмяСобытия, Параметр, Источник)
	// Смарт Фролов+
	//++ #Б-4672 смарт: Фролов 24.10.2025 //Контроль возврата УПД с подписью клиента
	//Если ИмяСобытия="ПодписьДокумента" И 
	Если (ИмяСобытия="ПодписьДокумента" ИЛИ ИмяСобытия="ПодписанаТН") И 
	//-- #Б-4672 смарт: Фролов 24.10.2025
		(ТипЗнч(Источник)=Тип("ДокументСсылка.РеализацияТоваровУслуг") Или ТипЗнч(Источник)=Тип("ДокументСсылка.АктВыполненныхРабот")) Тогда 
		Элементы.СписокДокументыПродажи.Обновить();
	КонецЕсли;	
	// Фролов- 
КонецПроцедуры

&НаСервере
Процедура смарт_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	//++ #1353 смарт: Фролов 04.09.2023 //Доработать логику взаимодействия с Адмирал по нескольким складам (УТ + БП)
	НоваяКоманда = Команды.Добавить("смартСформироватьПакетДокументов");
	НоваяКоманда.Действие = "смартСформироватьПакетДокументов";
	НоваяКоманда.Заголовок = "Сформировать пакет документов (смарт)";
	
	НовыйЭлемент = Элементы.Добавить("смартСформироватьПакетДокументов",
									Тип("КнопкаФормы"),
									Элементы.СписокГруппаКомандыСписка);
	НовыйЭлемент.ИмяКоманды = "смартСформироватьПакетДокументов"; 
	
	
	смартСервер.смартДобавитьКнопкуИнформацииНаФорму("смартСформироватьПакетДокументовПоказатьИнфо", "поле ""Формирование пакета документов""", 
						Элементы.СписокГруппаКомандыСписка, ЭтаФорма);
	//-- #1353 смарт: Фролов 04.09.2023
	
	//++ #Б3960 смарт: Шляпников 16.09.2025 / Добавление признака VIP клиента во все документы и в карточку партнера
	смартОбщегоНазначения.СоздатьЭлементыПризнакаVIPКлиентаНаФормеСписка(ЭтаФорма,
																		 "РеестрДокументовПереопределяемый", 
																		 "РегистрСведений.РеестрДокументов КАК РеестрДокументовПереопределяемый", 
																		 "РеестрДокументовПереопределяемый.Ссылка КАК Ссылка,",
																		 "СписокДокументыПродажи",
																		 ,
																		 Ложь,
																		 "СписокДокументыПродажиПартнер");
	//-- #Б3960 смарт: Шляпников 16.09.2025
	
	//++ #Б-4672 смарт: Фролов 22.10.2025 //Контроль возврата УПД с подписью клиента
	СписокДокументыПродажи.Параметры.УстановитьЗначениеПараметра("СвойствоПодписан", 
		ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("ИдентификаторДляФормул", "Подписан"));
	СписокДокументыПродажи.Параметры.УстановитьЗначениеПараметра("СвойствоПодписанаТН", 
		ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("ИдентификаторДляФормул", "ПодписанаТН"));
	//-- #Б-4672 смарт: Фролов 22.10.2025	
	
КонецПроцедуры

#КонецОбласти

#Область ДоработкиСмарт

&НаКлиенте
Процедура СкопироватьВБуферОбмена(Текст)
	DOM=Элементы.смартБФ.Документ.DefaultView.document;
	textArea=DOM.createElement("textarea");
	textArea.value=Текст;
	DOM.body.appendChild(textArea);
	textArea.focus();
	textArea.select();
	DOM.execCommand("copy");
	DOM.body.removeChild(textArea);
КонецПроцедуры

&НаКлиенте
Процедура смартПодписать(Команда)
	ТекущиеДанные=Элементы.СписокДокументыПродажи.ТекущиеДанные;
	Ссылка=ТекущиеДанные.Ссылка;
	Если Не (ТипЗнч(Ссылка)=Тип("ДокументСсылка.РеализацияТоваровУслуг") Или ТипЗнч(Ссылка)=Тип("ДокументСсылка.АктВыполненныхРабот")) Тогда 
		Состояние("По выбранной строке не устанавливается свойство 'Документ подписан'",,"Установка 'Документ подписан' 
		|только для Реализации товаров услуг
		|и Актов выполненных работ.");
		Возврат;
	КонецЕсли;
	Результат=РезультатПодписиДокумента(Ссылка);
	Если Результат.Подписан Тогда
		СкопироватьВБуферОбмена(Результат.ИмяФайла);
		Элементы.СписокДокументыПродажи.Обновить();
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция РезультатПодписиДокумента(Ссылка)
	Результат=Новый Структура("Подписан,ИмяФайла",Ложь);
	СчетФактура=УчетНДСРФВызовСервера.СчетФактураВыданныйПоОснованию(Ссылка,Ссылка.Организация);
	Результат.ИмяФайла=смартСервер.ПолучитьИмяФайлаДляБуфераОбмена(Ссылка.ЗаказКлиента,СчетФактура);
	
	ДанныеПроверки=смартСервер.ЕстьВозможностьПодписатьДокумент(Ссылка,Ссылка.ЗаказКлиента,СчетФактура);
	Результат.Подписан=ДанныеПроверки.Результат;
	Если Не ДанныеПроверки.Результат Тогда
		Для Каждого Ошибка Из ДанныеПроверки.Ошибки Цикл 
			ОбщегоНазначения.СообщитьПользователю(Ошибка);
		КонецЦикла;
	КонецЕсли;
	Возврат Результат;
КонецФункции	

&НаКлиенте
Процедура смартСнятьПодпись(Команда)
	ТекущиеДанные=Элементы.СписокДокументыПродажи.ТекущиеДанные;
	Ссылка=ТекущиеДанные.Ссылка;
	Если Не (ТипЗнч(Ссылка)=Тип("ДокументСсылка.РеализацияТоваровУслуг") Или ТипЗнч(Ссылка)=Тип("ДокументСсылка.АктВыполненныхРабот"))
		И Не ТекущиеДанные.Подписан Тогда
		Возврат;
	КонецЕсли;
	СнятьПодписьСДокумента(Ссылка);
	Элементы.СписокДокументыПродажи.Обновить();
КонецПроцедуры

&НаСервере
Процедура СнятьПодписьСДокумента(Ссылка)
	смартСервер.УстановитьДокументПодписан(Ссылка,Ссылка.ЗаказКлиента,Ложь);
КонецПроцедуры	

&НаКлиенте
Процедура смартСкопировать(Команда)
	ТекущиеДанные=Элементы.СписокДокументыПродажи.ТекущиеДанные;
	Ссылка=ТекущиеДанные.Ссылка;
	Если Не (ТипЗнч(Ссылка)=Тип("ДокументСсылка.РеализацияТоваровУслуг") Или ТипЗнч(Ссылка)=Тип("ДокументСсылка.АктВыполненныхРабот")) Тогда 
		Состояние("По выбранной строке не устанавливается свойство 'Документ подписан'",,"Установка 'Документ подписан' 
		|только для Реализации товаров услуг
		|и Актов выполненных работ.");
		Возврат;
	КонецЕсли;
	ТекстДляБуфераОбмена=ПолучитьТекстДляБуфераОбмена(Ссылка);	
	СкопироватьВБуферОбмена(ТекстДляБуфераОбмена);
КонецПроцедуры

&НаСервере
Функция ПолучитьТекстДляБуфераОбмена(Ссылка)
	СчетФактура=УчетНДСРФВызовСервера.СчетФактураВыданныйПоОснованию(Ссылка,Ссылка.Организация);
	Если Не ЗначениеЗаполнено(СчетФактура) Тогда
		Сообщить("По выбранному документу не введена счет фактура.");
		Возврат Неопределено;
	КонецЕсли;
	Возврат смартСервер.ПолучитьИмяФайлаДляБуфераОбмена(Ссылка.ЗаказКлиента,СчетФактура);
КонецФункции	

&НаКлиенте
//++ #1353 смарт: Фролов 04.09.2023 //Доработать логику взаимодействия с Адмирал по нескольким складам (УТ + БП)
Процедура смартСформироватьПакетДокументов(Команда)
	
	ВыделенныеСтроки = Элементы.СписокДокументыПродажи.ВыделенныеСтроки;
	
	МассивИД = Новый Массив;
	
	Для Каждого ВыделеннаяСтрока Из ВыделенныеСтроки Цикл
		МассивИД.Добавить(ВыделеннаяСтрока);
	КонецЦикла;
	
	Для Каждого ИД Из МассивИД Цикл		
		ДанныеСтроки = Элементы.СписокДокументыПродажи.ДанныеСтроки(ИД);
		ДокСсылка = ДанныеСтроки.Ссылка;
		Если ТипЗнч(ДокСсылка)=Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			смартСформироватьПакетДокументовДалее(ДокСсылка);		 
		КонецЕсли;
	КонецЦикла;	
	
	Элементы.СписокДокументыПродажи.Обновить();
	
КонецПроцедуры  //-- #1353 смарт: Фролов 04.09.2023

&НаКлиенте
//++ #1353 смарт: Фролов 04.09.2023 //Доработать логику взаимодействия с Адмирал по нескольким складам (УТ + БП)  
Процедура смартСформироватьПакетДокументовДалее(ДокСсылка) Экспорт
	
	// 1. Создание подкаталога
	// 2. Формирование ПФ УПД, Счета, заявки на машину, заявки на отгрузку
	// 3. Запись в РС
	// 4. Отправка документов на эл. почту
	
	Успех = Истина;
		
	Склад = Б_ОбщиеПроцедурыИФункцииСервер.ПолучитьРеквизитОбъекта(ДокСсылка, "Склад"); 
	
	//++ #1932 смарт: Мосолов 17.07.2024 //Ошибка формирования пакета документов на Адмирал  
	//Если НЕ Б_ОбщиеПроцедурыИФункцииСервер.ПолучитьРеквизитОбъекта(Склад, "смартАвтоматическиФормироватьДокументы") Тогда 
	//++ #Б-2540 смарт: Лопато 27.02.2025 //Ошибка при формировании пакета документов на Адмирал Ковчег по ООО Ковчег  
	Если Б_ОбщиеПроцедурыИФункцииСервер.ПолучитьРеквизитОбъекта(Склад, "ЭтоГруппа") 
		ИЛИ НЕ Б_ОбщиеПроцедурыИФункцииСервер.ПолучитьРеквизитОбъекта(Склад, "смартАвтоматическиФормироватьДокументы") Тогда  
	//-- #Б-2540 смарт: Лопато 27.02.2025
	//-- #1932 смарт: Мосолов 17.07.2024   
	
		ОбщегоНазначенияКлиент.СообщитьПользователю("Пакет документов формируется только для склада Адмирал, для реализации "+ДокСсылка+" пакет не может быть сформирован");
		Возврат;
	КонецЕсли;
	
	Если Б_ОбщиеПроцедурыИФункцииСервер.ПолучитьРеквизитОбъекта(Склад, "смартФормироватьДокументыУТБП") = ПредопределенноеЗначение("Перечисление.смартФормироватьДокументыУТБП.БП") Тогда 
		ОбщегоНазначенияКлиент.СообщитьПользователю("Пакет документов для реализации "+ДокСсылка+" формируется в базе Бухгалтерии");
		Возврат;
	КонецЕсли;	
	ЗаказКлиента=Б_ОбщиеПроцедурыИФункцииСервер.ПолучитьРеквизитОбъекта(ДокСсылка, "ЗаказКлиента"); 
	Если НЕ ЗначениеЗаполнено(ЗаказКлиента) Тогда 
		ОбщегоНазначенияКлиент.СообщитьПользователю("Для корректного формирования пакета для реализации "+ДокСсылка+" должен быть указан Заказ клиента");
		Возврат;
	КонецЕсли;
	
	Если НЕ Б_ОбщиеПроцедурыИФункцииСервер.ПолучитьРеквизитОбъекта(ЗаказКлиента, "СпособДоставки") = ПредопределенноеЗначение("Перечисление.СпособыДоставки.смартСамовывозСоСкладаАдмирал") Тогда 
		ОбщегоНазначенияКлиент.СообщитьПользователю("Пакет документов для реализации "+ДокСсылка+" не сформирован, потому что способ доставки в документе не ""Самовывоз со склада Адмирал""");
		Возврат;
	КонецЕсли;
	
	КаталогСохраненияФайлов = смартОбщегоНазначенияКлиент.СоздатьКаталогПФРеализацияТиУ(ДокСсылка,,Склад);
	
	Если НЕ ЗначениеЗаполнено(КаталогСохраненияФайлов) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен каталог для сохранения файлов. ПФ не сформированы.");
		Возврат;
	КонецЕсли;
	
	// 2.3 Формирование заявки на машину
	// 2.4 Формирование заявки на отгрузку

	// Подключение к УТ для получения данных из Заказа клиента
	
	ТабДокументыПоДаннымИзУТ = смартСформироватьТабличныеДокументыДляПакета(ДокСсылка);
		
	СпособОтгрузкиСоСкладаАдмирал = Ложь;
	ВЗаказеСкладАдмирал = Ложь;
	НазваниеАвто = "";
	НомерАвто = "";
	
	ИмяФайлаЗаявкаНаМашину = "";
	ТабДокЗаявкаНаМашину = ТабДокументыПоДаннымИзУТ.ТабДокЗаявкаНаМашину;
	ИмяФайлаЗаявкаНаМашину = ТабДокументыПоДаннымИзУТ.ИмяФайлаЗаявкаНаМашину;

	ПолноеИмяФайлаЗаявкаНаМашину = КаталогСохраненияФайлов + "\" + ИмяФайлаЗаявкаНаМашину;
	
		
	ИмяФайлаЗаявкаНаОтгрузку = "";
	ТабДокЗаявкаНаОтгрузку = ТабДокументыПоДаннымИзУТ.ТабДокЗаявкаНаОтгрузку;
	ИмяФайлаЗаявкаНаОтгрузку = ТабДокументыПоДаннымИзУТ.ИмяФайлаЗаявкаНаОтгрузку;

	ПолноеИмяФайлаЗаявкаНаОтгрузку = КаталогСохраненияФайлов + "\" + ИмяФайлаЗаявкаНаОтгрузку;
	
	НазваниеАвто = ТабДокументыПоДаннымИзУТ.НазваниеАвто;
	НомерАвто = ТабДокументыПоДаннымИзУТ.НомерАвто;
	СпособОтгрузкиСоСкладаАдмирал = ТабДокументыПоДаннымИзУТ.СпособОтгрузкиСоСкладаАдмирал;
	ВЗаказеСкладАдмирал = ТабДокументыПоДаннымИзУТ.ВЗаказеСкладАдмирал;
	
	Если НЕ ВЗаказеСкладАдмирал Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("В заказе клиента в УТ не указан склад Адмирал");
		Возврат;		
	КонецЕсли;
	
	// 2.7 Формирование XML
	
	ДокСсылкаНомер = Б_ОбщиеПроцедурыИФункцииСервер.ПолучитьРеквизитОбъекта(ДокСсылка, "Номер");
	ДокСсылкаДата = Б_ОбщиеПроцедурыИФункцииСервер.ПолучитьРеквизитОбъекта(ДокСсылка, "Дата");
	
	
	ИмяФайлаXMLПоЗаявкамНаОтгрузку = "ПакетДанныхПоЗаявкамНаОтгрузку " 
										+ ДокСсылкаНомер + " " + Формат(ДокСсылкаДата, "ДЛФ=Д") + " " + СокрЛП(Строка(Склад)) + ".XML";
	ПолноеИмяФайлаXMLПоЗаявкамНаОтгрузку = КаталогСохраненияФайлов + "\" + ИмяФайлаXMLПоЗаявкамНаОтгрузку;
	
	
	ДвоичныеДанныеXML = ТабДокументыПоДаннымИзУТ.ДвоичныеДанныеXML;
	
	УспехЗаписиXML = Ложь;
	
	ОтправлятьПисьмо = Истина;
	
	Если НЕ СпособОтгрузкиСоСкладаАдмирал Тогда
		ОтправлятьПисьмо = Ложь;
		ТабДокЗаявкаНаМашину = Неопределено;
	КонецЕсли;
	
	// 2.1 Формирование УПД
	
	ИмяФайлаУПД = "";
	//Если смартОбщегоНазначения.ЭтоУниверсальныйДокумент(ДокСсылка) Тогда 
		ТабДокУПД = смартСформироватьТабличныйДокументУПД(ДокСсылка, ИмяФайлаУПД);
	//Иначе
	//	ТабДокУПД = смартОбщегоНазначения.СформироватьТабличныйДокументТОРГ12(ДокСсылка, ИмяФайлаУПД);
	//КонецЕсли;

	Если ТабДокУПД = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось сформировать ПФ УПД. Возможно, для документа " + ДокСсылка + " не введен счет-фактура");
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ИмяФайлаУПД) Тогда
		ИмяФайлаУПД = "УПД";		
	КонецЕсли;
	
	ПолноеИмяФайлаУПД = КаталогСохраненияФайлов + "\" + ИмяФайлаУПД;
	
	// 2.2 Формирование Счета

	ИмяФайлаСчет = "";
	ТабДокСчет = смартСформироватьТабличныйДокументСчет(ДокСсылка, ИмяФайлаСчет);	
	Если ТабДокСчет = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось сформировать ПФ счета на оплату. Возможно, для документа " + ДокСсылка + " не введен счет");
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ИмяФайлаСчет) Тогда
		ИмяФайлаСчет = "Счет";
	КонецЕсли;
	
	ПолноеИмяФайлаСчет = КаталогСохраненияФайлов + "\" + ИмяФайлаСчет;
	Если СпособОтгрузкиСоСкладаАдмирал Тогда
		
		// 2.5 Формирование Транспортной накладной
		
		ИмяФайлаТН = "";
		ТабДокТН = смартСформироватьТабличныйДокументТранспортнаяНакладная(ДокСсылка, ИмяФайлаТН, НазваниеАвто, НомерАвто);	
		Если ТабДокТН = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось сформировать ПФ транспортной накладной.");
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ИмяФайлаТН) Тогда
			ИмяФайлаТН = "ТранспортнаяНакладная";
		КонецЕсли;
		
		ПолноеИмяФайлаТН = КаталогСохраненияФайлов + "\" + ИмяФайлаТН;
		
	Иначе
		ТабДокТН = Неопределено;
	КонецЕсли;
			
	// Сохранение файлов
	
	Попытка
		ТабДокУПД.Записать(ПолноеИмяФайлаУПД, ТипФайлаТабличногоДокумента.PDF);
		ТабДокСчет.Записать(ПолноеИмяФайлаСчет, ТипФайлаТабличногоДокумента.PDF);
		
		Если ТабДокЗаявкаНаМашину <> Неопределено Тогда
			ТабДокЗаявкаНаМашину.Записать(ПолноеИмяФайлаЗаявкаНаМашину, ТипФайлаТабличногоДокумента.XLSX);
			ОбщегоНазначенияКлиент.СообщитьПользователю("Сохранен файл " + ПолноеИмяФайлаЗаявкаНаМашину);
		КонецЕсли;
		
		Если ТабДокЗаявкаНаОтгрузку <> Неопределено Тогда
			ТабДокЗаявкаНаОтгрузку.Записать(ПолноеИмяФайлаЗаявкаНаОтгрузку, ТипФайлаТабличногоДокумента.XLSX);
			ОбщегоНазначенияКлиент.СообщитьПользователю("Сохранен файл " + ПолноеИмяФайлаЗаявкаНаОтгрузку);
		КонецЕсли;
		
		Если ТабДокТН <> Неопределено Тогда
			ТабДокТН.Записать(ПолноеИмяФайлаТН, ТипФайлаТабличногоДокумента.PDF);
			ОбщегоНазначенияКлиент.СообщитьПользователю("Сохранен файл " + ПолноеИмяФайлаТН);
		КонецЕсли;
		
		Если ТипЗнч(ДвоичныеДанныеXML) = Тип("ДвоичныеДанные") Тогда
			ДвоичныеДанныеXML.Записать(ПолноеИмяФайлаXMLПоЗаявкамНаОтгрузку);
			УспехЗаписиXML = Истина;
			ОбщегоНазначенияКлиент.СообщитьПользователю("Сохранен файл " + ПолноеИмяФайлаXMLПоЗаявкамНаОтгрузку);
		КонецЕсли;
		
		ОбщегоНазначенияКлиент.СообщитьПользователю("Сохранен файл " + ПолноеИмяФайлаУПД);
		ОбщегоНазначенияКлиент.СообщитьПользователю("Сохранен файл " + ПолноеИмяФайлаСчет);
				
	Исключение
		Успех = Ложь;
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не удалось сохранить печатные формы:" + Символы.ПС + ОписаниеОшибки());
	КонецПопытки;
		
	
	Если Успех Тогда    
		
		//++ #1766 смарт: Мосолов 09.04.2024 //Создать предварительный шаг по контролю созданных документов в БП при отгрузке  
		Если ТипЗнч(ДокСсылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			
			смартЗаписатьИнформациюОЗаписиПакета(ДокСсылка, КаталогСохраненияФайлов);
			
		КонецЕсли;
		//-- #1766 смарт: Мосолов 09.04.2024 
		
		// 4. Отправка документов на эл. почту
		
		Если ОтправлятьПисьмо Тогда
			
		АдресХранилищаУПД = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ПолноеИмяФайлаУПД), Новый УникальныйИдентификатор);
		АдресХранилищаСчет = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ПолноеИмяФайлаСчет), Новый УникальныйИдентификатор);
		АдресХранилищаЗаявкаНаМашину = "";
		
		Если ТабДокЗаявкаНаМашину <> Неопределено Тогда			
			АдресХранилищаЗаявкаНаМашину = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ПолноеИмяФайлаЗаявкаНаМашину), Новый УникальныйИдентификатор);
		КонецЕсли;
		
		Если ТабДокЗаявкаНаОтгрузку <> Неопределено Тогда
			АдресХранилищаЗаявкаНаОтгрузку = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ПолноеИмяФайлаЗаявкаНаОтгрузку), Новый УникальныйИдентификатор);
		КонецЕсли;
		
		Если ТабДокТН <> Неопределено Тогда
			АдресХранилищаТН = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ПолноеИмяФайлаТН), Новый УникальныйИдентификатор);
		КонецЕсли;
		
		МассивСтруктур = Новый Массив;
		
		ТекСтруктура = Новый Структура;
		ТекСтруктура.Вставить("ИмяФайла", ИмяФайлаУПД);
		ТекСтруктура.Вставить("АдресХранилища", АдресХранилищаУПД);
		МассивСтруктур.Добавить(ТекСтруктура);
		
		ТекСтруктура = Новый Структура;
		ТекСтруктура.Вставить("ИмяФайла", ИмяФайлаСчет);
		ТекСтруктура.Вставить("АдресХранилища", АдресХранилищаСчет);
		МассивСтруктур.Добавить(ТекСтруктура);
						
		Если ТабДокЗаявкаНаМашину <> Неопределено Тогда 
			ТекСтруктура = Новый Структура;
			ТекСтруктура.Вставить("ИмяФайла", ИмяФайлаЗаявкаНаМашину);
			ТекСтруктура.Вставить("АдресХранилища", АдресХранилищаЗаявкаНаМашину);
			МассивСтруктур.Добавить(ТекСтруктура);
		КонецЕсли;
		
		Если ТабДокЗаявкаНаОтгрузку <> Неопределено Тогда
			ТекСтруктура = Новый Структура;
			ТекСтруктура.Вставить("ИмяФайла", ИмяФайлаЗаявкаНаОтгрузку);
			ТекСтруктура.Вставить("АдресХранилища", АдресХранилищаЗаявкаНаОтгрузку);
			МассивСтруктур.Добавить(ТекСтруктура);
		КонецЕсли;
		
		Если ТабДокТН <> Неопределено Тогда
			ТекСтруктура = Новый Структура;
			ТекСтруктура.Вставить("ИмяФайла", ИмяФайлаТН);
			ТекСтруктура.Вставить("АдресХранилища", АдресХранилищаТН);
			МассивСтруктур.Добавить(ТекСтруктура);		
		КонецЕсли;
		
		Если УспехЗаписиXML Тогда
			АдресХранилищаXMLЗаявкаНаМашину = ПоместитьВоВременноеХранилище(ДвоичныеДанныеXML, Новый УникальныйИдентификатор);
			
			ТекСтруктура = Новый Структура;
			ТекСтруктура.Вставить("ИмяФайла", ИмяФайлаXMLПоЗаявкамНаОтгрузку);
			ТекСтруктура.Вставить("АдресХранилища", АдресХранилищаXMLЗаявкаНаМашину);
			МассивСтруктур.Добавить(ТекСтруктура);
		КонецЕсли;

		смартОбщегоНазначения.ОтправитьПакетДокументовНаПочту(МассивСтруктур, ДокСсылка,,Склад,Истина);
		
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры  //-- #1353 смарт: Фролов 04.09.2023  

//++ #1766 смарт: Мосолов 09.04.2024 //Создать предварительный шаг по контролю созданных документов в БП при отгрузке  
&НаСервере
Процедура смартЗаписатьИнформациюОЗаписиПакета(ДокументРеализации, КаталогСохраненияФайлов)   
	
	УстановитьПривилегированныйРежим(Истина);
	
	НоваяЗапись = РегистрыСведений.смартСформированныеПакетыПФ.СоздатьМенеджерЗаписи();
	НоваяЗапись.Документ = ДокументРеализации;
	НоваяЗапись.ПакетСформирован = Истина; 
	НоваяЗапись.КаталогСохраненияФайлов = КаталогСохраненияФайлов; 
	НоваяЗапись.Записать(Истина);
	
	УстановитьПривилегированныйРежим(Ложь);  
	
КонецПроцедуры 	//-- #1766 смарт: Мосолов 09.04.2024   

&НаКлиенте
//++ #1353 смарт: Фролов 04.09.2023 //Доработать логику взаимодействия с Адмирал по нескольким складам (УТ + БП)  
Функция смартСформироватьТабличныеДокументыДляПакета(ДокСсылка) Экспорт
	
	СтруктураВозврат = Новый Структура;
	
	СтруктураВозврат.Вставить("ТабДокЗаявкаНаМашину", 	Неопределено);
	СтруктураВозврат.Вставить("ИмяФайлаЗаявкаНаМашину", "");
	СтруктураВозврат.Вставить("ТабДокЗаявкаНаОтгрузку", Неопределено);
	СтруктураВозврат.Вставить("ИмяФайлаЗаявкаНаОтгрузку", "");
	СтруктураВозврат.Вставить("НазваниеАвто", "");
	СтруктураВозврат.Вставить("НомерАвто", "");
	
	СпособОтгрузкиСоСкладаАдмирал = Ложь;
	ВЗаказеСкладАдмирал = Ложь;
	НазваниеАвто = "";
	НомерАвто = "";
	смартПроверитьЗаказКлиента(ДокСсылка, СпособОтгрузкиСоСкладаАдмирал, ВЗаказеСкладАдмирал, НазваниеАвто, НомерАвто);
	
	СтруктураВозврат.Вставить("СпособОтгрузкиСоСкладаАдмирал", СпособОтгрузкиСоСкладаАдмирал);
	СтруктураВозврат.Вставить("ВЗаказеСкладАдмирал", ВЗаказеСкладАдмирал);
	СтруктураВозврат.Вставить("НазваниеАвто", НазваниеАвто);
	СтруктураВозврат.Вставить("НомерАвто", НомерАвто);

	СтруктураВозврат.Вставить("ДвоичныеДанныеXML", Неопределено);
	
	Если НЕ ВЗаказеСкладАдмирал Тогда
		Возврат СтруктураВозврат;
	КонецЕсли;
	
	Если СпособОтгрузкиСоСкладаАдмирал Тогда
	
	ИмяФайлаЗаявкаНаМашину = "";
	ТабДокЗаявкаНаМашину = смартСформироватьТабличныйДокументЗаявкаНаМашину(ДокСсылка, ИмяФайлаЗаявкаНаМашину, "xlsx");
	
	Иначе
		ИмяФайлаЗаявкаНаМашину = "";
		ТабДокЗаявкаНаМашину = Неопределено;
	КонецЕсли;

	ИмяФайлаЗаявкаНаОтгрузку = "";
	ТабДокЗаявкаНаОтгрузку = смартСформироватьТабличныйДокументЗаявкаНаОтгрузку(ДокСсылка, ИмяФайлаЗаявкаНаОтгрузку, "xlsx");
	
	СтруктураВозврат.Вставить("ТабДокЗаявкаНаМашину", 	ТабДокЗаявкаНаМашину);
	СтруктураВозврат.Вставить("ИмяФайлаЗаявкаНаМашину", ИмяФайлаЗаявкаНаМашину);
	СтруктураВозврат.Вставить("ТабДокЗаявкаНаОтгрузку", ТабДокЗаявкаНаОтгрузку);
	СтруктураВозврат.Вставить("ИмяФайлаЗаявкаНаОтгрузку", ИмяФайлаЗаявкаНаОтгрузку);
	
	ДвоичныеДанныеXML = смартСформироватьXMLПоЗаявкаНаОтгрузку(ДокСсылка, "ПакетДанныхПоЗаявкамНаОтгрузку.XML");
	СтруктураВозврат.Вставить("ДвоичныеДанныеXML", ДвоичныеДанныеXML);
	
	Возврат СтруктураВозврат;
	
КонецФункции //-- #1353 смарт: Фролов 04.09.2023 

&НаСервере
//++ #1353 смарт: Фролов 04.09.2023 //Доработать логику взаимодействия с Адмирал по нескольким складам (УТ + БП)  
Процедура смартПроверитьЗаказКлиента(ДокСсылка, СпособОтгрузкиСоСкладаАдмирал, ВЗаказеСкладАдмирал, НазваниеАвто, НомерАвто)
	
	Запрос=Новый Запрос;
	
	Запрос.УстановитьПараметр("Номер", ДокСсылка.Номер);
	Запрос.УстановитьПараметр("Дата", ДокСсылка.Дата);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.ЗаказКлиента КАК Заказ
	|ПОМЕСТИТЬ ВТ_Заказ
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Номер = &Номер
	|	И РеализацияТоваровУслуг.Дата = &Дата
	|;
	|
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ЗаказКлиента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.смартСамовывозСоСкладаАдмирал)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК СпособОтгрузкиСоСкладаАдмирал,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ЗаказКлиента.Склад <> ЗНАЧЕНИЕ(Справочник.Склады.ПУстаяСсылка)
	|					И ЗаказКлиента.Склад.смартАвтоматическиФормироватьДокументы
	|				ТОГДА ИСТИНА
	|			КОГДА ЗаказКлиентаТовары.Склад.смартАвтоматическиФормироватьДокументы
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК ВЗаказеСкладАдмирал,
	|	МАКСИМУМ(ЗаказКлиента.смартВидТранспорта) КАК смартВидТранспорта,
	|	МАКСИМУМ(ЗаказКлиента.смартНомерМашины) КАК НомерМашины,
	|	МАКСИМУМ(ЗаказКлиента.смартНомерПрицепа) КАК смартНомерПрицепа
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|		ПО ЗаказКлиента.Ссылка = ЗаказКлиентаТовары.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Заказ КАК ВТ_Заказ
	|		ПО ЗаказКлиента.Ссылка = ВТ_Заказ.Заказ";
	
	ТЗ_УТ1 = Запрос.Выполнить().Выгрузить();
	
	Для Каждого ТекСтрока Из ТЗ_УТ1 Цикл
		СпособОтгрузкиСоСкладаАдмирал = ТекСтрока.СпособОтгрузкиСоСкладаАдмирал;
		ВЗаказеСкладАдмирал = ТекСтрока.ВЗаказеСкладАдмирал;
		НазваниеАвто = ТекСтрока.смартВидТранспорта;
		НомерАвто = СокрЛП(ТекСтрока.НомерМашины + " " + ТекСтрока.смартНомерПрицепа); 
	КонецЦикла;
	
КонецПроцедуры  //-- #1353 смарт: Фролов 04.09.2023

&НаСервере
//++ #1353 смарт: Фролов 04.09.2023 //Доработать логику взаимодействия с Адмирал по нескольким складам (УТ + БП) 
Функция смартСформироватьТабличныйДокументЗаявкаНаМашину(ДокСсылка, ИмяФайла = "", РасширениеФайла = "xlsx") Экспорт
	
	РезультатТабДок = Неопределено;
	
	Макет = ПолучитьОбщийМакет("смартЗаявкаНаМашину");
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.АвтоМасштаб = Истина;
	
	Запрос=Новый Запрос;
	
	Запрос.УстановитьПараметр("Номер", ДокСсылка.Номер);
	Запрос.УстановитьПараметр("Дата", ДокСсылка.Дата);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.ЗаказКлиента КАК Заказ
	|ПОМЕСТИТЬ ВТ_Заказ
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Номер = &Номер
	|	И РеализацияТоваровУслуг.Дата = &Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказКлиента.Номер КАК Номер,
	|	ЗаказКлиента.Контрагент.Наименование КАК Контрагент,
	|	ЗаказКлиента.Организация.Наименование КАК Организация,
	|	ЗаказКлиента.смартВидТранспорта КАК ВидТранспорта,
	|	ЗаказКлиента.смартНомерМашины КАК НомерМашины,
	|	ЗаказКлиента.смартНомерПрицепа КАК смартНомерПрицепа,
	|	ЗаказКлиента.смартФИОВодителя КАК ФИОВодителя,
	|	ЗаказКлиента.смартНомерСерияПаспортВодителя КАК смартНомерСерияПаспортВодителя,
	|	ЗаказКлиента.смартДатаВыдачиПаспортаВодителя КАК смартДатаВыдачиПаспортаВодителя, 
	|	ЗаказКлиента.смартФИОВторогоВодителя КАК смартФИОВторогоВодителя,
	|	ЗаказКлиента.смартНомерСерияПаспортВторогоВодителя КАК смартНомерСерияПаспортВторогоВодителя,
	|	ЗаказКлиента.смартДатаВыдачиПаспортаВторогоВодителя КАК смартДатаВыдачиПаспортаВторогоВодителя, 
	//++#1631 смарт: Лопато 14.02.2024 //Формирование пакета документов самовывоз со склада Адмирал  
	//|	ЗаказКлиента.ЖелаемаяДатаОтгрузки КАК ЖелаемаяДатаОтгрузки,
	|	ЗаказКлиента.смартЖелаемаяДатаОтгрузкиАдмирал КАК ЖелаемаяДатаОтгрузки,
	//--#1631 смарт: Лопато 14.02.2024
	|	ЗаказКлиента.смартЖелаемоеВремяОтгрузки КАК смартЖелаемоеВремяОтгрузки,
	|	ПРЕДСТАВЛЕНИЕ(ЗаказКлиента.СпособДоставки) КАК СпособДоставки
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Заказ КАК ВТ_Заказ
	|		ПО (ЗаказКлиента.Ссылка = ВТ_Заказ.Заказ)
	|ГДЕ
	|	ВЫБОР 
	|		КОГДА ЗаказКлиента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.смартСамовывозСоСкладаАдмирал)
	|      		ТОГДА ИСТИНА
	|       ИНАЧЕ ЛОЖЬ
	|   КОНЕЦ";
	     	
	ТЗ_УТ1 = Запрос.Выполнить().Выгрузить();
		
	ЕстьДанные = Ложь;
	ДатаДокумента = ДокСсылка.Дата;
	ЭтоПервый=Истина;
	
	Для Каждого Выборка Из ТЗ_УТ1 Цикл
		
		ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
				
		//++#1631 смарт: Лопато 14.02.2024 //Формирование пакета документов самовывоз со склада Адмирал  
		//ДатаВремя = Формат(ДатаДокумента, "ДФ=dd.MM.yyyy");
		Если ЗначениеЗаполнено(Выборка.ЖелаемаяДатаОтгрузки) Тогда
			ДатаВремя = Формат(Выборка.ЖелаемаяДатаОтгрузки, "ДФ=dd.MM.yyyy");
		Иначе
			ДатаВремя = Формат(ДатаДокумента, "ДФ=dd.MM.yyyy");
		КонецЕсли;	
		//--#1631 смарт: Лопато 14.02.2024
		смартЖелаемоеВремяОтгрузки = Выборка.смартЖелаемоеВремяОтгрузки;
		
		Если ЗначениеЗаполнено(смартЖелаемоеВремяОтгрузки) Тогда
			ДатаВремя = ДатаВремя + " " + Формат(смартЖелаемоеВремяОтгрузки, "ДФ=HH:mm");	
		КонецЕсли;
		Если ЭтоПервый Тогда

			ОбластьШапка.Параметры.ДатаОтгрузки = Формат(ДатаВремя, "ДФ=dd.MM.yyyy");
			ОбластьШапка.Параметры.ДеньНедели 	= ВРег(Сред(формат(ДатаВремя,"ДФ=дддд"),1,1)) + Сред(формат(ДатаВремя,"ДФ=дддд"),2,СтрДлина(формат(ДатаВремя,"ДФ=дддд"))+1);
			ОбластьШапка.Параметры.АдресСклада = ФормированиеПечатныхФорм.ПолучитьАдресИзКонтактнойИнформации(ДокСсылка.Склад, "", ДатаВремя);
			ТабДок.Вывести(ОбластьШапка);
		
		КонецЕсли;
		
		ЭтоПервый = Ложь;  
		
		ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
		
		ОбластьСтрока.Параметры.ДатаВремя 	= ДатаВремя;
		ОбластьСтрока.Параметры.Контрагент 	= Выборка.Контрагент;
		ОбластьСтрока.Параметры.НомерЗаказа 	= Выборка.Номер;
		ОбластьСтрока.Параметры.ВидТранспорта = Выборка.ВидТранспорта;
		ОбластьСтрока.Параметры.НомерМашины 	= Выборка.НомерМашины;
		ОбластьСтрока.Параметры.ФИОВодителя 	= Выборка.ФИОВодителя;
		
		Если ЗначениеЗаполнено(Выборка.смартДатаВыдачиПаспортаВодителя) Тогда
			ОбластьСтрока.Параметры.Паспорт = Выборка.смартНомерСерияПаспортВодителя + " выдан: " + Формат(Выборка.смартДатаВыдачиПаспортаВодителя, "ДФ=dd.MM.yyyy");
		Иначе
			ОбластьСтрока.Параметры.Паспорт = Выборка.смартНомерСерияПаспортВодителя;
		КонецЕсли; 
		Если ЗначениеЗаполнено(Выборка.смартФИОВторогоВодителя) Тогда
			ОбластьСтрока.Параметры.ФИОВодителя=ОбластьСтрока.Параметры.ФИОВодителя+Символы.ПС+Выборка.смартФИОВторогоВодителя;	
		КонецЕсли;	                                                                                                         
		Если ЗначениеЗаполнено(Выборка.смартДатаВыдачиПаспортаВторогоВодителя) ТОгда
			ОбластьСтрока.Параметры.Паспорт=ОбластьСтрока.Параметры.Паспорт+Символы.ПС+Выборка.смартНомерСерияПаспортВторогоВодителя + " выдан: " + Формат(Выборка.смартДатаВыдачиПаспортаВторогоВодителя, "ДФ=dd.MM.yyyy");		
		Иначе
			ОбластьСтрока.Параметры.Паспорт=ОбластьСтрока.Параметры.Паспорт+Символы.ПС+Выборка.смартНомерСерияПаспортВторогоВодителя;
		КонецЕсли;	
		ОбластьСтрока.Параметры.КолПаллет = 1;
		
		ТабДок.Вывести(ОбластьСтрока);

		ЕстьДанные = Истина;
	КонецЦикла;	
			
	Если ЕстьДанные Тогда
		ИмяФайла = "Заявка на машину по заказу клиента №" + Выборка.Номер + "." + РасширениеФайла;
		Возврат ТабДок;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции //-- #1353 смарт: Фролов 04.09.2023

&НаСервере
//++ #1353 смарт: Фролов 04.09.2023 //Доработать логику взаимодействия с Адмирал по нескольким складам (УТ + БП) 
Функция смартСформироватьТабличныйДокументЗаявкаНаОтгрузку(ДокСсылка, ИмяФайла = "", РасширениеФайла = "xlsx") Экспорт
	
	РезультатТабДок = Новый ТабличныйДокумент;
		
	Макет = ПолучитьОбщийМакет("смартЗаявкаНаОтгрузку");
		
	НазваниеДокумента = НСтр("ru = 'Заявка на отгрузку'");
	
	ОбластьЗаголовка = Макет.ПолучитьОбласть("ЗаголовокПеремещение");	
	ОбластьЗаголовка.Параметры.ТекстЗаголовка = НазваниеДокумента; 

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА Организации.НаименованиеСокращенное <> """"
	|			ТОГДА Организации.НаименованиеСокращенное
	|		ИНАЧЕ Организации.Наименование
	|	КОНЕЦ КАК ОрганизацияНаименование,
	|	ПРЕДСТАВЛЕНИЕ(РеализацияТоваровУслуг.Склад) КАК Склад,
	|	Контрагенты.Наименование КАК Контрагент,
	|	РеализацияТоваровУслуг.Грузоотправитель КАК Грузоотправитель,
	|	РеализацияТоваровУслуг.Грузополучатель КАК Грузополучатель
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО РеализацияТоваровУслуг.Организация = Организации.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО РеализацияТоваровУслуг.Контрагент = Контрагенты.Ссылка
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДокСсылка);
	
	ВыборкаШапка = Запрос.Выполнить().Выбрать();

	ВыборкаШапка.Следующий();
	
	ОрганизацияНаименование = ВыборкаШапка.ОрганизацияНаименование;
	СкладОтправитель = ВыборкаШапка.Склад;
	СкладПолучатель = ВыборкаШапка.Контрагент;
	
	ОбластьЗаголовка.Параметры.ОрганизацияПредставление = СокрЛП(ОрганизацияНаименование);
	ОбластьЗаголовка.Параметры.ОтправительПредставление = СокрЛП(СкладОтправитель);
	ОбластьЗаголовка.Параметры.ПолучательПредставление = СокрЛП(СкладПолучатель);
	
	РезультатТабДок.Вывести(ОбластьЗаголовка);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.ЗаказКлиента КАК Заказ
	|ПОМЕСТИТЬ ВТ_Заказ
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Номер = &Номер
	|	И РеализацияТоваровУслуг.Дата = &Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ТоварыКОтгрузкеОстатки.ДокументОтгрузки КАК Документ.ЗаказКлиента).Номер КАК Номер, 
	|	ВЫРАЗИТЬ(ТоварыКОтгрузкеОстатки.ДокументОтгрузки КАК Документ.ЗаказКлиента).Дата КАК Дата,
	|	ВЫРАЗИТЬ(ТоварыКОтгрузкеОстатки.ДокументОтгрузки КАК Документ.ЗаказКлиента).Контрагент.Наименование КАК Контрагент,
	|	ВЫРАЗИТЬ(ТоварыКОтгрузкеОстатки.ДокументОтгрузки КАК Документ.ЗаказКлиента).Организация.Наименование КАК Организация,
	|	ТоварыКОтгрузкеОстатки.Номенклатура.Наименование КАК Наименование,
	|	ТоварыКОтгрузкеОстатки.Номенклатура.Артикул КАК Артикул,
	|	ТоварыКОтгрузкеОстатки.Номенклатура.Код КАК Код,
	|	ПРЕДСТАВЛЕНИЕ(ТоварыКОтгрузкеОстатки.Серия) КАК Серия,
	|	ПРЕДСТАВЛЕНИЕ(ТоварыКОтгрузкеОстатки.Характеристика) КАК Характеристика,
	|	ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток КАК КоличествоУпаковок,
	|	ПРЕДСТАВЛЕНИЕ(ТоварыКОтгрузкеОстатки.Номенклатура.ЕдиницаИзмерения) КАК ЕдиницаИзмерения
	|ИЗ
	|	РегистрНакопления.ТоварыКОтгрузке.Остатки(, Склад.смартАвтоматическиФормироватьДокументы И ДокументОтгрузки В (ВЫБРАТЬ ВТ.Заказ ИЗ ВТ_Заказ КАК ВТ)) КАК ТоварыКОтгрузкеОстатки";
	
	Запрос.УстановитьПараметр("Номер", ДокСсылка.Номер);
	Запрос.УстановитьПараметр("Дата", ДокСсылка.Дата);
	ТЗ_УТ = Запрос.Выполнить().Выгрузить();
		
	ЕстьДанные = Ложь;
	
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	РезультатТабДок.Вывести(ОбластьШапкаТаблицы);
	
	НомерЗаказа = "";
	ДатаЗаказа = "";
	НомерСтроки = 0;
    
    ИтогУпаковок=0;

	Для Каждого ВыборкаТЧ Из ТЗ_УТ Цикл
								
		НомерЗаказа = ВыборкаТЧ.Номер;
		ДатаЗаказа = ВыборкаТЧ.Дата;
		
		Серия = ВыборкаТЧ.Серия;
		Если ЗначениеЗаполнено(Серия) Тогда
			Если Найти(Серия, "до") > 0 Тогда
				Серия = Сред(Серия, 1, Найти(Серия, "до") - 1);
			КонецЕсли;	
		КонецЕсли;
		Если ЗначениеЗаполнено(ВыборкаТЧ.Характеристика) Тогда
			Серия =  Строка(Серия) + " " + Строка(ВыборкаТЧ.Характеристика)
		КонецЕсли;
		НомерСтроки = НомерСтроки + 1;
		
		ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
		ОбластьСтрока.Параметры.НомерСтроки = НомерСтроки;
		ОбластьСтрока.Параметры.Товар 		= ВыборкаТЧ.Наименование;
		ОбластьСтрока.Параметры.Код 		= ПрефиксацияОбъектовКлиентСервер.УдалитьПрефиксыИзНомераОбъекта(ВыборкаТЧ.Код, Истина, Истина);
		Артикул = СтрЗаменить(ВыборкаТЧ.Артикул, " ", "");
		ОбластьСтрока.Параметры.Артикул 	= Артикул;
        ОбластьСтрока.Параметры.АртикулEN 	= СтроковыеФункции.СтрокаЛатиницей(Артикул);
		ОбластьСтрока.Параметры.Серия 		= Серия;
		
		ОбластьСтрока.Параметры.КоличествоУпаковок = ВыборкаТЧ.КоличествоУпаковок;
        ИтогУпаковок=ИтогУпаковок+ВыборкаТЧ.КоличествоУпаковок;
		ОбластьСтрока.Параметры.ПредставлениеЕдининицыИзмеренияУпаковки = ВыборкаТЧ.ЕдиницаИзмерения;
		
		ОбластьСтрока.Параметры.ПредставлениеБазовойЕдиницыИзмерения = "паллет";
		
		РезультатТабДок.Вывести(ОбластьСтрока);

		ЕстьДанные = Истина;

	КонецЦикла;
	ИмяФайла = "Заявка на отгрузку по заказу клиента №" + НомерЗаказа + "." + РасширениеФайла;

	ПредставлениеЗаказаКлиента = "Заказ клиента " + НомерЗаказа + " от " + ДатаЗаказа;
	
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
    Если ИтогУпаковок>0 Тогда
        ОбластьПодвал.Параметры.ИтогУпаковок 		= ИтогУпаковок;
    КонецЕсли; 
	РезультатТабДок.Вывести(ОбластьПодвал);

	ОбластьПодписи = Макет.ПолучитьОбласть("Подписи");
	ОбластьПодписи.Параметры.ФИОМенеджер = "Нечипоренко В.В.";
	РезультатТабДок.Вывести(ОбластьПодписи);
	
	ОбластьКомментарий = Макет.ПолучитьОбласть("Комментарий");
	ОбластьКомментарий.Параметры.Документы = ПредставлениеЗаказаКлиента;
	РезультатТабДок.Вывести(ОбластьКомментарий);
	
	РезультатТабДок.ОтображатьСетку = Ложь;
	РезультатТабДок.АвтоМасштаб = Истина;
	
	Если ЕстьДанные Тогда		
		Возврат РезультатТабДок;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции  //-- #1353 смарт: Фролов 04.09.2023

&НаСервере
//++ #1353 смарт: Фролов 04.09.2023 //Доработать логику взаимодействия с Адмирал по нескольким складам (УТ + БП) 
Функция смартСформироватьXMLПоЗаявкаНаОтгрузку(ДокСсылка, ИмяФайла)
	
	Запрос=Новый Запрос;
	
	Запрос.УстановитьПараметр("Номер", ДокСсылка.Номер);
	Запрос.УстановитьПараметр("Дата", ДокСсылка.Дата);
	Запрос.УстановитьПараметр("ВидНоменклатурыНаименование", "ТоварРулоныХарактеристики");
	

	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеализацияТоваровУслуг.ЗаказКлиента КАК Заказ
	|ПОМЕСТИТЬ ВТ_Заказ
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Номер = &Номер
	|	И РеализацияТоваровУслуг.Дата = &Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТоварыКОтгрузкеОстатки.ДокументОтгрузки КАК ДокументОтгрузки,
	|	НоменклатураСпр.Наименование КАК НоменклатураНаименование,
	|	НоменклатураСпр.Код КАК НоменклатураКод,
	|	НоменклатураСпр.Артикул КАК НоменклатураАртикул,
	|	ТоварыКОтгрузкеОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыКОтгрузкеОстатки.Серия КАК Серия,
	|	ТоварыКОтгрузкеОстатки.Характеристика КАК Характеристика,
	|	ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток КАК КоличествоУпаковок,
	|	НоменклатураСпр.ЕдиницаИзмерения КАК НоменклатураЕдиницаИзмерения,
	|	НоменклатураСпр.Описание КАК НоменклатураОписание,
	|	НоменклатураСпр.ВидНоменклатуры.Наименование КАК ВидНоменклатурыНаименование
	|ПОМЕСТИТЬ ВТ_ЗаказКлиентаОстатки
	|ИЗ
	|	РегистрНакопления.ТоварыКОтгрузке.Остатки(
	|	,Склад.смартАвтоматическиФормироватьДокументы
	|			И ДокументОтгрузки В
	|				(ВЫБРАТЬ
	|					ВТ.Заказ
	|				ИЗ
	|					ВТ_Заказ КАК ВТ)) КАК ТоварыКОтгрузкеОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСпр
	|		ПО ТоварыКОтгрузкеОстатки.Номенклатура = НоменклатураСпр.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказКлиентаСсылка.Номер КАК Номер,
	|	ПРЕДСТАВЛЕНИЕ(ЗаказКлиентаСсылка.Контрагент) КАК Контрагент,
	|	ЗаказКлиентаСсылка.смартНомерМашины + "" "" + ЗаказКлиентаСсылка.смартВидТранспорта КАК ТранспортноеСредство,
	|	ПРЕДСТАВЛЕНИЕ(ЗаказКлиентаСсылка.Организация) КАК Перевозчик,
	|	ЗаказКлиентаСсылка.смартВидТранспорта КАК Марка,
	|	ЗаказКлиентаСсылка.смартНомерМашины КАК НомерМашины,
	|	ЗаказКлиентаСсылка.смартНомерПрицепа КАК смартНомерПрицепа,
	|	ЗаказКлиентаСсылка.смартФИОВодителя КАК ФИОВодителя,
	|	ЗаказКлиентаСсылка.смартНомерСерияПаспортВодителя КАК смартНомерСерияПаспортВодителя,
	|	ЗаказКлиентаСсылка.смартДатаВыдачиПаспортаВодителя КАК смартДатаВыдачиПаспортаВодителя,
	|	ЗаказКлиентаСсылка.смартФИОВторогоВодителя КАК смартФИОВторогоВодителя,
	|	ЗаказКлиентаСсылка.смартНомерСерияПаспортВторогоВодителя КАК смартНомерСерияПаспортВторогоВодителя,
	|	ЗаказКлиентаСсылка.смартДатаВыдачиПаспортаВторогоВодителя КАК смартДатаВыдачиПаспортаВторогоВодителя, 
	|	ЗаказКлиентаСсылка.смартЖелаемаяДатаОтгрузкиАдмирал КАК ЖелаемаяДатаОтгрузки,
	|	ЗаказКлиентаСсылка.смартЖелаемоеВремяОтгрузки КАК смартЖелаемоеВремяОтгрузки,
	|	ВТ_ЗаказКлиентаОстатки.НоменклатураНаименование КАК НоменклатураНаименование,
	|	ВТ_ЗаказКлиентаОстатки.НоменклатураАртикул КАК НоменклатураАртикул,
	|	ВТ_ЗаказКлиентаОстатки.НоменклатураКод КАК НоменклатураКод,
	|	ПРЕДСТАВЛЕНИЕ(ЗаказКлиентаСсылка.Ссылка) КАК ЗаказКлиента,
	|	ВТ_ЗаказКлиентаОстатки.НоменклатураОписание КАК НоменклатураОписание,
	|	ПРЕДСТАВЛЕНИЕ(ВТ_ЗаказКлиентаОстатки.Серия) КАК Серия,
	|	ПРЕДСТАВЛЕНИЕ(ВТ_ЗаказКлиентаОстатки.Характеристика) КАК Характеристика,
	|	ВТ_ЗаказКлиентаОстатки.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ПРЕДСТАВЛЕНИЕ(ВТ_ЗаказКлиентаОстатки.НоменклатураЕдиницаИзмерения) КАК НоменклатураЕдиницаИзмерения,
	|	ЗаказКлиентаСсылка.АдресДоставки КАК АдресДоставки,
	|	ВЫБОР КОГДА ВТ_ЗаказКлиентаОстатки.ВидНоменклатурыНаименование = &ВидНоменклатурыНаименование ТОГДА Истина Иначе Ложь КОНЕЦ КАК ЭтоНоменклатураВПогонныхМетрах
	|ИЗ
	|	ВТ_Заказ КАК ВТ_Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКлиентаСсылка
	|		ПО ВТ_Заказ.Заказ = ЗаказКлиентаСсылка.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗаказКлиентаОстатки КАК ВТ_ЗаказКлиентаОстатки
	|		ПО ВТ_Заказ.Заказ = ВТ_ЗаказКлиентаОстатки.ДокументОтгрузки
	|ГДЕ
	|	ЗаказКлиентаСсылка.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.смартСамовывозСоСкладаАдмирал)";
     	
	ВыгрузкаВыборкаАвто = Запрос.Выполнить().Выгрузить();
			
	Если ВыгрузкаВыборкаАвто.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;

	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Автомобиль");
	ТЗ.Колонки.Добавить("Trip");
	ТЗ.Колонки.Добавить("Avto_Num");
	ТЗ.Колонки.Добавить("Avto_Num_Trailer");
	ТЗ.Колонки.Добавить("Avto_Model");
	ТЗ.Колонки.Добавить("Data");
	ТЗ.Колонки.Добавить("Date_Plan");
	ТЗ.Колонки.Добавить("Driver");
	ТЗ.Колонки.Добавить("Driver_Pasport");
	ТЗ.Колонки.Добавить("Driver_Phone");
	ТЗ.Колонки.Добавить("Driver2");
	ТЗ.Колонки.Добавить("Driver2_Pasport");
	ТЗ.Колонки.Добавить("Driver2_Phone");
	ТЗ.Колонки.Добавить("Provider");
	ТЗ.Колонки.Добавить("Client");
	ТЗ.Колонки.Добавить("Shipment");
	ТЗ.Колонки.Добавить("Delivery");
	ТЗ.Колонки.Добавить("Adres");
	ТЗ.Колонки.Добавить("Id_Adr");
	ТЗ.Колонки.Добавить("March_num");
	ТЗ.Колонки.Добавить("Delivery_Type");
	ТЗ.Колонки.Добавить("Code_Prod");
	ТЗ.Колонки.Добавить("Id_Prod");
	ТЗ.Колонки.Добавить("Name");
	ТЗ.Колонки.Добавить("Serial_Number");
	ТЗ.Колонки.Добавить("Quan_Pallet");
	ТЗ.Колонки.Добавить("Date_partii");
	ТЗ.Колонки.Добавить("Lable");
	ТЗ.Колонки.Добавить("Quan");
	ТЗ.Колонки.Добавить("QuanSTUOM");
	ТЗ.Колонки.Добавить("QuanST");
	
	СписокАвто = Новый ТаблицаЗначений;
	СписокАвто.Колонки.Добавить("Автомобиль");
	СписокАвто.Колонки.Добавить("Trip");
	СписокАвто.Колонки.Добавить("Avto_Num");
	СписокАвто.Колонки.Добавить("Avto_Num_Trailer");
	СписокАвто.Колонки.Добавить("Avto_Model");
	СписокАвто.Колонки.Добавить("Data");
	СписокАвто.Колонки.Добавить("Date_Plan");
	СписокАвто.Колонки.Добавить("Driver");
	СписокАвто.Колонки.Добавить("Driver_Pasport");
	СписокАвто.Колонки.Добавить("Driver_Phone");
	СписокАвто.Колонки.Добавить("Driver2");
	СписокАвто.Колонки.Добавить("Driver2_Pasport");
	СписокАвто.Колонки.Добавить("Driver2_Phone");
	Для каждого ВыборкаАвто из ВыгрузкаВыборкаАвто Цикл
		Если Не ЗначениеЗаполнено(ВыборкаАвто.КоличествоУпаковок) Тогда Продолжить КонецЕсли; 
		смартЖелаемоеВремяОтгрузки = ВыборкаАвто.смартЖелаемоеВремяОтгрузки;

		//++#1631 смарт: Лопато 14.02.2024 //Формирование пакета документов самовывоз со склада Адмирал  
		//ДатаВремя = Формат(ДокСсылка.Дата, "ДФ=dd.MM.yyyy");
		Если ЗначениеЗаполнено(ВыборкаАвто.ЖелаемаяДатаОтгрузки) Тогда
			ДатаДокумента = Формат(ВыборкаАвто.ЖелаемаяДатаОтгрузки, "ДФ=dd.MM.yyyy");
		Иначе
			ДатаДокумента = Формат(ДокСсылка.Дата, "ДФ=dd.MM.yyyy");
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(смартЖелаемоеВремяОтгрузки) Тогда
			ДатаВремя = ДатаДокумента + " " + Формат(смартЖелаемоеВремяОтгрузки, "ДФ=HH:mm");
		иначе
			ДатаВремя = ДатаДокумента + " " + Формат(ТекущаяДата() + 60 * 60 * 2, "ДФ=HH:mm"); 
		КонецЕсли;
		//--#1631 смарт: Лопато 14.02.2024
					
		аа = ТЗ.Добавить();
		аа.Автомобиль 		= СокрЛП(ВыборкаАвто.ТранспортноеСредство);
		Trip = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ВыборкаАвто.Номер, Истина, Истина);
		аа.Trip 			= Trip;
		аа.Avto_Num 		= СокрЛП(ВыборкаАвто.НомерМашины);
		аа.Avto_Num_Trailer = СокрЛП(ВыборкаАвто.смартНомерПрицепа);
		аа.Avto_Model 		= СокрЛП(ВыборкаАвто.Марка);
		//++#1631 смарт: Лопато 14.02.2024 //Формирование пакета документов самовывоз со склада Адмирал  
		//аа.Data 			= Формат(ДокСсылка.Дата, "ДФ=dd.MM.yyyy"); 
		аа.Data 			= ДатаДокумента; 
		//--#1631 смарт: Лопато 14.02.2024
		аа.Date_Plan 		= ДатаВремя;
		аа.Driver 			= СокрЛП(ВыборкаАвто.ФИОВодителя);
		Если ЗначениеЗаполнено(ВыборкаАвто.смартДатаВыдачиПаспортаВодителя) Тогда
			аа.Driver_Pasport = СокрЛП(ВыборкаАвто.смартНомерСерияПаспортВодителя + " выдан: " + Формат(ВыборкаАвто.смартДатаВыдачиПаспортаВодителя, "ДФ=dd.MM.yyyy"));
		Иначе
			аа.Driver_Pasport = СокрЛП(ВыборкаАвто.смартНомерСерияПаспортВодителя);
		КонецЕсли;
		аа.Driver_Phone = ""; 
		аа.Driver2 = СокрЛП(ВыборкаАвто.смартФИОВторогоВодителя);
		Если ЗначениеЗаполнено(ВыборкаАвто.смартДатаВыдачиПаспортаВторогоВодителя) Тогда
			аа.Driver2_Pasport = СокрЛП(ВыборкаАвто.смартНомерСерияПаспортВторогоВодителя + " выдан: " + Формат(ВыборкаАвто.смартДатаВыдачиПаспортаВторогоВодителя, "ДФ=dd.MM.yyyy"));
		Иначе
			аа.Driver2_Pasport = СокрЛП(ВыборкаАвто.смартНомерСерияПаспортВторогоВодителя);
		КонецЕсли;
		аа.Driver2_Phone = "";
		Отбор = Новый Структура();
		Отбор.Вставить("Автомобиль",		аа.Автомобиль);
		Отбор.Вставить("Trip", 				аа.Trip);
		Отбор.Вставить("Avto_Num",			аа.Avto_Num);
		Отбор.Вставить("Avto_Num_Trailer",	аа.Avto_Num_Trailer);
		Отбор.Вставить("Avto_Model",		аа.Avto_Model);
		Отбор.Вставить("Data",				аа.Data);
		Отбор.Вставить("Date_Plan",			аа.Date_Plan);
		Отбор.Вставить("Driver",			аа.Driver);
		Отбор.Вставить("Driver_Pasport",	аа.Driver_Pasport);
		
		Нашел = СписокАвто.НайтиСтроки(Отбор);
		
		Если Нашел.Количество() = 0 Тогда
			СтрокаСписокАвто = СписокАвто.Добавить();
			СтрокаСписокАвто.Автомобиль			= аа.Автомобиль;
			СтрокаСписокАвто.Trip 				= аа.Trip;
			СтрокаСписокАвто.Avto_Num			= аа.Avto_Num;
			СтрокаСписокАвто.Avto_Num_Trailer 	= аа.Avto_Num_Trailer;
			СтрокаСписокАвто.Avto_Model			= аа.Avto_Model;
			СтрокаСписокАвто.Data				= аа.Data;
			СтрокаСписокАвто.Date_Plan			= аа.Date_Plan;
			СтрокаСписокАвто.Driver				= аа.Driver;
			СтрокаСписокАвто.Driver_Pasport		= аа.Driver_Pasport;
			СтрокаСписокАвто.Driver_Phone 		= "";
			СтрокаСписокАвто.Driver2			= аа.Driver2;
			СтрокаСписокАвто.Driver2_Pasport	= аа.Driver2_Pasport;
			СтрокаСписокАвто.Driver2_Phone 		= аа.Driver2_Phone;
		КонецЕсли;
		
		Серия = ВыборкаАвто.Серия;
		Если ЗначениеЗаполнено(Серия) Тогда
			Если Найти(Серия, "до") > 0 Тогда
				Серия = Сред(Серия, 1, Найти(Серия, "до") - 1);
			КонецЕсли;	
		КонецЕсли;
		Если ЗначениеЗаполнено(ВыборкаАвто.Характеристика) Тогда
			Серия =  Строка(Серия) + " " + Строка(ВыборкаАвто.Характеристика)
		КонецЕсли;
		Серия = СокрЛП(Серия);
		
		Перевозчик = СокрЛП(ВыборкаАвто.Перевозчик);
		
		аа.Provider 		= Перевозчик;
		аа.Client 			= СокрЛП(ВыборкаАвто.Контрагент);
		аа.Shipment 		= СокрЛП(ВыборкаАвто.Номер);
		аа.Delivery 		= СокрЛП(ВыборкаАвто.ЗаказКлиента);
		аа.Adres 			= СокрЛП(ВыборкаАвто.АдресДоставки);
		аа.Id_Adr 			= "";
		аа.March_num 		= "";
		аа.Delivery_Type 	= "Otgruzka";
		аа.Code_Prod 		= смартОбщегоНазначения.ОбработатьКодНоменклатуры(ВыборкаАвто.НоменклатураКод);
		
		Id_Prod = СтроковыеФункции.СтрокаЛатиницей(СокрЛП(ВыборкаАвто.НоменклатураАртикул));
		аа.Id_Prod 			= Id_Prod;		
		Name = СтрЗаменить(СокрЛП(Лев(ВыборкаАвто.НоменклатураНаименование,255)), """", "");
		аа.Name 			= Name;                        
		аа.Serial_Number 	= Серия;
		аа.Quan_Pallet	 	= "1";
		аа.Date_partii 		= "";
		аа.Lable 			= СокрЛП(Лев(ВыборкаАвто.НоменклатураОписание,255));
		аа.Quan 			= Формат(ВыборкаАвто.КоличествоУпаковок,"ЧДЦ=3; ЧГ=0");
		аа.QuanSTUOM 		= СокрЛП(ВыборкаАвто.НоменклатураЕдиницаИзмерения);
		аа.QuanST = "";
		Если ЗначениеЗаполнено(ВыборкаАвто.Характеристика)
			И ВыборкаАвто.ЭтоНоменклатураВПогонныхМетрах  Тогда
			аа.QuanST = Строка(ВыборкаАвто.Характеристика);
			аа.Serial_Number 	= "";
			аа.QuanSTUOM 		= СокрЛП("рул");
			Намотка = Число(ВыборкаАвто.Характеристика);
			аа.Quan 			= Формат(ВыборкаАвто.КоличествоУпаковок/Намотка,"ЧДЦ=3; ЧГ=0");//здесь будет количество рулонов !!! Деление на ноль не обрабатываем, чтобы если возникнет ошибка, сразу сообщили.
		КонецЕсли;
	КонецЦикла;
		
	ПолныйФайл = КаталогВременныхФайлов() + "\" + ИмяФайла;
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(ПолныйФайл, "windows-1251");
	ЗаписьXML.ЗаписатьОбъявлениеXML();    
	ЗаписьXML.ЗаписатьНачалоЭлемента("Delivery_export");
	
	Для каждого Стр Из СписокАвто Цикл
		
		Отбор = Новый Структура();
		
		Отбор.Вставить("Автомобиль",		Стр.Автомобиль);
		Отбор.Вставить("Trip", 				Стр.Trip);
		Отбор.Вставить("Avto_Num",			Стр.Avto_Num);
		Отбор.Вставить("Avto_Num_Trailer",	Стр.Avto_Num_Trailer);
		Отбор.Вставить("Avto_Model",		Стр.Avto_Model);
		Отбор.Вставить("Data",				Стр.Data);
		Отбор.Вставить("Date_Plan",			Стр.Date_Plan);
		Отбор.Вставить("Driver",			Стр.Driver);
		Отбор.Вставить("Driver_Pasport",	Стр.Driver_Pasport);
		
		Нашел2 = ТЗ.НайтиСтроки(Отбор);
		
		Если Нашел2.Количество() > 0 Тогда
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("Delivery");
			ЗаписьXML.ЗаписатьАтрибут("Trip", 				Стр.Trip);
			ЗаписьXML.ЗаписатьАтрибут("Avto_Num", 			Стр.Avto_Num);
			ЗаписьXML.ЗаписатьАтрибут("Avto_Num_Trailer", 	Стр.Avto_Num_Trailer);
			ЗаписьXML.ЗаписатьАтрибут("Avto_Model", 		Стр.Avto_Model);
			ЗаписьXML.ЗаписатьАтрибут("Data", 				Стр.Data);
			ЗаписьXML.ЗаписатьАтрибут("Date_Plan", 			Стр.Date_Plan);
			ЗаписьXML.ЗаписатьАтрибут("Driver", 			Стр.Driver);
			ЗаписьXML.ЗаписатьАтрибут("Driver_Pasport", 	Стр.Driver_Pasport);
			ЗаписьXML.ЗаписатьАтрибут("Driver_Phone", 		Стр.Driver_Phone);
			ЗаписьXML.ЗаписатьАтрибут("Driver2", 			Стр.Driver2);
			ЗаписьXML.ЗаписатьАтрибут("Driver2_Pasport", 	Стр.Driver2_Pasport);
			ЗаписьXML.ЗаписатьАтрибут("Driver2_Phone", 		Стр.Driver2_Phone);
			Для каждого Стр2 Из Нашел2 Цикл
				ЗаписьXML.ЗаписатьНачалоЭлемента("Delivery_detail");
				ЗаписьXML.ЗаписатьАтрибут("Provider", 		Стр2.Provider);
				ЗаписьXML.ЗаписатьАтрибут("Client", 		Стр2.Client);
				ЗаписьXML.ЗаписатьАтрибут("Shipment", 		Стр2.Shipment);
				ЗаписьXML.ЗаписатьАтрибут("Delivery", 		Стр2.Delivery);
				ЗаписьXML.ЗаписатьАтрибут("Adres", 			Стр2.Adres);
				ЗаписьXML.ЗаписатьАтрибут("Id_Adr", 		Стр2.Id_Adr);
				ЗаписьXML.ЗаписатьАтрибут("March_num", 		Стр2.March_num);
				ЗаписьXML.ЗаписатьАтрибут("Delivery_Type", 	Стр2.Delivery_Type);
				ЗаписьXML.ЗаписатьАтрибут("Code_Prod", 		Стр2.Code_Prod);
				ЗаписьXML.ЗаписатьАтрибут("Id_Prod", 		Стр2.Id_Prod);
				ЗаписьXML.ЗаписатьАтрибут("Name", 			Стр2.Name);
				ЗаписьXML.ЗаписатьАтрибут("Serial_Number", 	Стр2.Serial_Number);
				ЗаписьXML.ЗаписатьАтрибут("Quan_Pallet", 	Стр2.Quan_Pallet);
				ЗаписьXML.ЗаписатьАтрибут("Date_partii", 	Стр2.Date_partii);
				ЗаписьXML.ЗаписатьАтрибут("Lable", 			Стр2.Lable);
				ЗаписьXML.ЗаписатьАтрибут("Quan", 			Стр2.Quan);
				ЗаписьXML.ЗаписатьАтрибут("QuanSTUOM", 		Стр2.QuanSTUOM);
				ЗаписьXML.ЗаписатьАтрибут("QuanST", 		Стр2.QuanST);
				ЗаписьXML.ЗаписатьКонецЭлемента(); // Delivery_detail
			КонецЦикла;
			ЗаписьXML.ЗаписатьКонецЭлемента(); // Delivery
		КонецЕсли;
	КонецЦикла;
	
	ЗаписьXML.ЗаписатьКонецЭлемента(); // Delivery_export
	ЗаписьXML.Закрыть();

	Двоичное = Новый ДвоичныеДанные(ПолныйФайл);
	
	Возврат Двоичное;
	
КонецФункции  //-- #1353 смарт: Фролов 04.09.2023

&НаСервере 
//++ #1353 смарт: Фролов 04.09.2023 //Доработать логику взаимодействия с Адмирал по нескольким складам (УТ + БП)
Функция смартСформироватьТабличныйДокументУПД(ДокСсылка, ИмяФайлаУПД);
	Возврат Документы.РеализацияТоваровУслуг.смартСформироватьТабличныйДокументУПД(ДокСсылка, ИмяФайлаУПД);                                                           
КонецФункции  //-- #1353 смарт: Фролов 04.09.2023

&НаСервере
//++ #1353 смарт: Фролов 04.09.2023 //Доработать логику взаимодействия с Адмирал по нескольким складам (УТ + БП)
Функция смартСформироватьТабличныйДокументСчет(Реализация, ИмяФайла)
    Возврат Документы.РеализацияТоваровУслуг.смартСформироватьТабличныйДокументСчетНаОплату(Реализация, ИмяФайла);
КонецФункции //-- #1353 смарт: Фролов 04.09.2023

&НаСервере
//++ #1353 смарт: Фролов 04.09.2023 //Доработать логику взаимодействия с Адмирал по нескольким складам (УТ + БП)
Функция смартСформироватьТабличныйДокументТранспортнаяНакладная(ДокСсылка, ИмяФайлаТН, НазваниеАвто, НомерАвто) 
	Номер = ДокСсылка.Номер;
	Номер = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Номер); 
	Если ЗначениеЗаполнено(ДокСсылка.ЗаказКлиента) ТОгда
		ЗаказКлиентаНомер=ДокСсылка.ЗаказКлиента.Номер; 
	Иначе
		ЗаказКлиентаНомер="";
	КонецЕсли;	
   	ИмяФайлаТН = "Транспортная накладная № " + Номер + " от " + Формат(ДокСсылка.Дата, "ДФ='dd MMMM yyyy ""г""'") +?(ЗаказКлиентаНомер = "",""," (по сч. "+ЗаказКлиентаНомер+")")+ ".pdf";  
    Возврат Документы.РеализацияТоваровУслуг.смартСформироватьТабличныйДокументТранспортнаяНакладная(ДокСсылка, ИмяФайлаТН, НазваниеАвто, НомерАвто);
КонецФункции //-- #1353 смарт: Фролов 04.09.2023

&НаКлиенте
//++ #1353 смарт: Фролов 13.09.2023 //Доработать логику взаимодействия с Адмирал по нескольким складам (УТ + БП)
Процедура смартДействиеПоказатьИнформацию(Команда)
	ИнформацияЗаголовок = "Формирование пакета документов (смарт)";
		ИнформацияТекст = СтроковыеФункцииКлиент.ФорматированнаяСтрока(
			  НСтр("ru = 'При нажатии кнопки <b>Сформировать пакет документов (смарт)</b>, будет сформирован пакет документов для складов Адмирал'")
			+ Символы.ПС 
			+ НСтр("ru = 'Пакет будет сформирован только если в Заказе клиента, на основании которого'")
			+ Символы.ПС 
			+ НСтр("ru = 'создана реализация, установлен способ доставки <b>Самовывоз со склада Адмирал</b>.'"));
			
	Если ЗначениеЗаполнено(ИнформацияЗаголовок) И ЗначениеЗаполнено(ИнформацияТекст) Тогда
		ОткрытьФорму("ОбщаяФорма.смартФормаИнформацияПоДоработкам", Новый Структура("Заголовок, Информация", ИнформацияЗаголовок, ИнформацияТекст), ЭтаФорма);
	КонецЕсли;  
	
КонецПроцедуры	//-- #1353 смарт: Фролов 13.09.2023
#КонецОбласти
